In [1]:
import pandas as pd
import numpy as np

In [ ]:
a = pd.read_csv("../data/test.csv")
a.head()

In [14]:
no_scroll_data = pd.read_csv("../data/company_names_400_pages.csv",encoding='ISO-8859-1')
no_scroll_data.head()

   company_no        company_name
0  5560004615          Skanska AB
1  5560614330             Peab AB
2  5560339086  Skanska Sverige AB
3  5566134929      NCC Sverige AB
4  5560999202     Peab Sverige AB

In [15]:
sample_companies = pd.read_csv("../../../../project_overview_sample_data/drive-download-20201127T093101Z-001/List of Base Companies.csv",
                              encoding='ISO-8859-1')
sample_companies.head()

   company_no                   company_name
0  5567988125               A Bergman Rör AB
1  5567988125               A Bergman Rör AB
2  5568391519                     A Brash AB
3  5568871411  A Bygg och Montage i Piteå AB
4  5569369977            A Byggare i Väst AB

In [23]:
no_scroll_data[no_scroll_data['company_no']=='641211XXXX']

      company_no         company_name
3747  641211XXXX  Fa Kjell Halvarsson

In [30]:
a = pd.Series(data=[1,2,3])
b = pd.Series(data=[1,2,3]).astype(object)
b[1] in a.astype(object)

True

In [37]:
new = []
l = len(sample_companies['company_no'].unique())
for num in no_scroll_data['company_no'].unique():
    count = 0
    for num2 in sample_companies['company_no'].unique():
        if num == str(num2):
            break
        else:    
            count += 1
    if count == l:
        new.append(num)
len(new)

3212

In [17]:
new = []
for s in no_scroll_data['company_name']:
    if s not in sample_companies['company_name']:
        new.append(s)
print(len(new))

8000

In [18]:
## all new companies

In [19]:
len(sample_companies['company_no'])+len(no_scroll_data['company_no'])

23534

In [41]:
sample_companies['company_no']

0        5567988125
1        5567988125
2        5568391519
3        5568871411
4        5569369977
            ...
15529    5565199402
15530    5568182058
15531    5568297674
15532    5565471538
15533    5566338686
Name: company_no, Length: 15534, dtype: int64

In [51]:
no_scroll_data[no_scroll_data['company_no']=='5567579148']

Empty DataFrame
Columns: [company_no, company_name]
Index: []

In [40]:
no_scroll_data['company_no']

0       5560004615
1       5560614330
2       5560339086
3       5566134929
4       5560999202
           ...
7995    5565207023
7996    5565962106
7997    5569555542
7998    5567079917
7999    5568151921
Name: company_no, Length: 8000, dtype: object